{
    "menu": {
        "about": "Sobre mí",
        "experience": "Experiencia",
        "projects": "Proyectos",
        "tech": "Tech stack",
        "contact": "Contactame"
    },
    "textBtn": {
        "downloadCV": "Descarga CV",
        "contact": "Contactame",
        "submit": "Enviar"
    },
    "about": {
        "title": "Sobre mí",
        "text": [
            "Fusiono creatividad y tecnología para crear experiencias intuitivas y visualmente atractivas. Atención al detalle y perfeccionismo.",
            "Terminando la carrera de Psicología, descubrí en la tecnología una nueva forma de entender y transformar el mundo. Me cautivó su potencial para la creación y la innovación, convirtiéndose en mi motor para aprender, explorar y afrontar nuevos desafíos con entusiasmo.",
            "Fuera del código, disfruto de activiades que nutren mi creatividad y dan un equilibrio a mi interés por la tecnología."
        ]
    },
    "experience": {
        "title": "Experiencia",
        "section": [
            {
                "date": "Noviembre 2024 - Abril 2025",
                "jobTitle": "BrainGaze - Software developer intern",
                "text": [
                    "Desarrollo de una aplicación móvil con un videojuego usando Unity y C#.",
                    "Diseño UX/UI y creación de assets e interfaces.",
                    "Depuración y testeo del juego, identificación y corrección de errores, ajuste de mecánicas y optimización para una experiencia fluida."
                ]
            },
            {
                "date": "N2024 - actual",
                "jobTitle": "Sitio web Pérez-Molina Piano Dúo",
                "text": [
                    "Sitio web corporativo para una pareja de pianistas, diseñado para mostrar su trayectoria musical.",
                    "Se está desarrollando con Vite, React, TypeScript y CSS, integrando un gestor de contenidos basado en Strapi y una API con Node.js. El proyecto sigue la metodología Agile y se gestiona mediante Git."
                ]
            }
        ]
    },
    "projects": {
        "title": "Proyectos",
        "section":[
            {
                "projectTitle": "Budget App",
                "text":[
                    "Aplicación de gestión financiera desarrollada con React y React Router.",
                    "Funcionalidades: Inicio de sesión, creación de presupuestos, envío de datos, formulario para la gestión de gastos, tablas y página de gastos, visualización de presupuestos en tarjetas, enlaces a presupuestos, eliminación de usuarios y notificaciones emergentes (toast messages)."
                ]
            },
            {
                "projectTitle": "Arkanoid",
                "text":[
                    "Juego retro desarrollado utilizando CSS, HTML y JavaScript.",
                    "Funcionalidades: Múltiples niveles, sistema de vidas, sistema de puntuación, funcionalidad de pausa, pantalla de Game Over y de victoria, efectos de sonido y diseño visual propio."
                ]
            },
            {
                "projectTitle": "Task Timer",
                "text":[
                    "Gestión y temporización de tareas, utilizando JavaScript, CSS y HTML.",
                    "Funcionalidades: Creación de tareas con tiempo asignado, cálculo del tiempo total trabajado y del tiempo a trabajar de tareas creadas, opción de pausar, eliminar, marcar tareas como completadas, cambio de estado al finalizar tarea y diseño visual propio."
                ]
            }
        ]
    },
    "contact": {
        "title": "Contactame",
        "name": "Nombre",
        "email": "Email",
        "subject": "Asunto",
        "message": "Mensaje"
    }
}